app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE (name like '%ffff%')
---
  def index
    @courses = Course.all

INSERT INTO "courses" ("name", "teacher", "place", "time", "credit", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "l"], ["teacher", "o"], ["place", "j"], ["time", "ii"], ["credit", "9"], ["created_at", "2015-04-09 15:34:46.965820"], ["updated_at", "2015-04-09 15:34:46.965820"]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save